---
layout: post
status: publish
published: true
title: 'Lyon Startup Weekend : retour d''exp&eacute;rience'
author:
  display_name: Séverin Bruhat
  login: admin_sbr
  email: sbruhat@gmail.com
  url: http://severin-bruhat.com
author_login: admin_sbr
author_email: sbruhat@gmail.com
author_url: http://severin-bruhat.com
wordpress_id: 317
wordpress_url: http://severin-bruhat.local/?p=317
date: '2014-02-26 09:13:36 +0000'
date_gmt: '2014-02-26 08:13:36 +0000'
categories:
- Blog
tags:
- Intelligence artificielle
comments: []
---
<p>
	Le weekend dernier, j&#39;ai particip&eacute; &agrave; mon premier Startup Weekend organis&eacute; &agrave; Lyon (par une super &eacute;quipe).</p>
<p>
	<a href="/blog-images/2014/02/swlyon-logo.png"><img alt="Logo du Lyon Startup Weekend" class="aligncenter size-full wp-image-329" height="141" src="/blog-images/2014/02/swlyon-logo.png" width="296" /></a></p>
<p>
	Le concept est simple : monter une startup en 54 heures. Un porteur de projet&nbsp;pr&eacute;sente son id&eacute;e, constitue&nbsp;son &eacute;quipe, et c&#39;est parti pour un weekend de folie !&nbsp;</p>
<h3>
	D&eacute;roulement du weekend<br />
</h3>
<p>
	<strong>Vendredi soir</strong>, <strong>18h30</strong>, tout le monde se regroupe dans un amphi de l&#39;INSA de Lyon. L&agrave;, les organisateurs nous pr&eacute;sentent le concept de l&#39;&eacute;v&egrave;nement, ainsi que&nbsp;leur &eacute;quipe et&nbsp;les coachs qui nous aiderons tout au long du weekend.<br />
	Apr&egrave;s &ccedil;a, c&#39;est &agrave; nous d&#39;entrer&nbsp;en jeu pour le "Half Baked Pitch":&nbsp;nous formons des &eacute;quipes, tirons 2 mots au sort&nbsp;et avons 10 minutes pour pr&eacute;parer un pitch d&#39;une minute pr&eacute;sentant&nbsp;notre projet. "Chat" et "Ukul&eacute;l&eacute;" sont les mots que nous tirons... &nbsp;mouai... Au final nous pr&eacute;sentons un concept innovant : Chatoul&eacute;l&eacute;. Il s&#39;agit d&#39;une application de tchat permettant de composer des m&eacute;lodies au Ukul&eacute;l&eacute; et des les envoyer &agrave; ses contacts. Toutes les pr&eacute;sentations sont hilarantes&nbsp;<span style="font-size: 13px;">:D.</span></p>
<p>
	Apr&egrave;s avoir bris&eacute; la glace, place &agrave; la pr&eacute;sentation&nbsp;des projets sous forme de pitch de 3 minutes. Un projet retient mon attention : <a href="http://liris.cnrs.fr/ideal/" target="_blank">IDEAL</a>.&nbsp;Il s&#39;agit d&#39;un algorithme d&#39;intelligence artificielle visant &agrave; atteindre l&#39;intelligence d&#39;un animal (et oui, nous sommes tr&egrave;s loin de l&#39;intelligence humaine, alors pourquoi ne pas commencer avec l&#39;intelligence animale ?) mis au point par <a href="http://www.oliviergeorgeon.com/" target="_blank">Olivier Georgeon</a>&nbsp;chercheur au <a href="http://liris.cnrs.fr/" target="_blank">LIRIS</a>. Apr&egrave;s le repas (autour de <strong>22h</strong>), je me greffe &agrave; ce projet avec 4 autres personnes et nous travaillons jusqu&#39;&agrave; <strong>2h30</strong> afin de trouver un produit. Nous n&#39;y parvenons pas r&eacute;ellement, mais&nbsp;la piste de l&#39;API voit le jour.</p>
<p>
	<span style="font-size: 13px;">Notre &eacute;quipe (de gauche &agrave; droite)&nbsp;: Renaud, Rapha&euml;l, Olivier, S&eacute;verin et&nbsp;Julien</span></p>
<p>
	<a href="/blog-imagesum wp-image-344" height="212" src="/blog-images/2014/02/equipe-300x21/blog-images/blog-images
<p>
	<span style="font-size: 13px;">​</span><strong style="line-height: 1.6em;">Samedi matin</strong><span style="line-height: 1.6em;">, l&#39;&eacute;quipe se retrouve&nbsp;</span><span style="line-height: 1.6em;">&agrave; <strong>10h</strong>&nbsp;afin de peaufiner l&#39;id&eacute;e. Pour &ecirc;tre honn&ecirc;te, &agrave; ce stade, je nous vois plut&ocirc;t mal partis, mais&nbsp;les &eacute;changes sont constructifs et enrichissants. Nous rencontrons quelques coachs qui trouvent notre projet int&eacute;ressant&nbsp;et nous donnent quelques pistes. Vers <strong>17h</strong>, les choses sont enfin claires : nous allons suivre&nbsp;2 pistes : IDEAL.lab et IDEAL.apps.&nbsp;Mais nous sommes en retard, tr&egrave;s en retard... Nous commen&ccedil;ons donc &agrave; travailler sur les parties juridiques, financi&egrave;res, marketing / commerciales et&nbsp;techniques tout en continuant &agrave; chercher des domaines d&#39;utilisation. Vers <strong>23h</strong>, conscients de notre retard et de la difficult&eacute; &agrave; r&eacute;pondre &agrave; la probl&eacute;matique mon&eacute;taire de la startup,&nbsp;nous d&eacute;cidons de nous concentrer sur la pr&eacute;sentation du projet et &eacute;tablissons le plan du support, puis nous nous r&eacute;partissons le travail &agrave;&nbsp;effectuer. Vers <strong>00h30</strong>, nous rentrons chez nous afin d&#39;avoir les id&eacute;es claires le lendemain.</span></p>
<p>
	<a href="/blog-imagesze-medium wp-image-362" height="196" src="/blog-images/2014/02/paperboard-30/blog-images/blog-images
<pre>
<strong><span style="font-size: 13px;">Petit focus sur le projet : </span></strong><span style="font-size: 13px;">ce projet est particulier car il repose sur la recherche fondamentale et  IDEAL est loin d&#39;avoir atteint son objectif. En revanche, pour Olivier, il est indispensable de valoriser l&#39;&eacute;tat actuel de ses recherches en trouvant une application concr&egrave;te de son algorithme. Nous avons eu du mal &agrave; touver un produit et sommes donc plut&ocirc;t partis sur un service. En gros, nous fournissons une API (Interface de programmation) afin que des partenaires / clients puissent utiliser IDEAL dans leur projet, il s&#39;agit d&#39;IDEAL.apps. C&#39;est sur ce service que repose la partie lucrative de notre projet. En parall&egrave;le, afin de faire avancer la recherche, nous allons cr&eacute;er une plateforme de "crowd research" permettant aux d&eacute;veloppeurs, geeks et chercheurs de collaborer sur le projet, il s&#39;agit d&#39;IDEAL.lab.</span>
	<a href="/blog-imagesize-medium wp-image-336" height="36" src="/blog-images/2014/02/logos-IDEAL-3/blog-images/blog-images
</pre>
<p>
	<strong>Dimanche matin</strong>, apr&egrave;s avoir insist&eacute; la veille pour que tout le monde soit op&eacute;rationnel &agrave; 9h, j&#39;arrive &agrave; <strong>9h25</strong> (bravo !).&nbsp;<br />
	Une partie de l&#39;&eacute;quipe s&#39;attaque au support de la&nbsp;pr&eacute;sentaton&nbsp;<span style="font-size: 13px;">&agrave; rendre aux organisateurs pour <strong>15h30</strong></span>, les autres&nbsp;travaillent sur le <a href="https://vine.co/" target="_blank">Vine</a> que chaque &eacute;quipe doit r&eacute;aliser pour pr&eacute;senter son projet en 6 secondes :</p>
<p style="text-align: center;">
	<iframe class="vine-embed" frameborder="0" height="300" src="https://vine.co/v/MmJqUVanHUw/embed/simple?audio=1" width="300"></iframe><script async src="//platform.vine.co/static/scripts/embed.js" charset="utf-8"></script></p>
<p>
	<span style="line-height: 1.6em;">Pour ma part, je me concentre sur les domaines d&#39;utilisation, ainsi que sur les aspects financiers et&nbsp;juridiques. Je fais &agrave; nouveau appel &agrave; un&nbsp;coach afin de faire le point sur les licences et les droits d&#39;auteur. Vers <strong>13h30</strong>, le support est quasi termin&eacute;, et Julien, notre "pitcheur" pr&eacute;pare son discours. Pendant ce temps, nous finalisons les sch&eacute;mas, logos et autres d&eacute;tails. </span></p>
<p>
	<span style="line-height: 1.6em;"><strong>17h</strong>, un coup de vuvuzela (arme favorite des organisateurs au cours du weekend)&nbsp;sonne le d&eacute;but de la fin. Nous nous rendons dans l&#39;amphi afin d&#39;assister (et de participer) aux pr&eacute;sentations et remise des prix. Chaque &eacute;quipe fait un pitch de 5 minutes pour pr&eacute;senter son travail et r&eacute;pond &agrave; 3 minutes de questions. Notre &eacute;quipe est la septi&egrave;me &agrave; passer&nbsp;(sur 9), Julien entre en sc&egrave;ne et envoie du lourd. Il obtient m&ecirc;me les applaudissements de toute la salle pour sa performance : un "flow" compar&eacute;&nbsp;&agrave; celui de Julien Lepers&nbsp;sur twitter :D. H&eacute;las nous n&#39;avons pas vraiment le temps de pr&eacute;senter la partie "concr&egrave;te" du projet dans le laps de temps qui nous est imparti.</span></p>
<p>
	<span style="line-height: 1.6em;"><strong>20h</strong>, le jury se retire pour d&eacute;lib&eacute;rer. La pression monte un peu, m&ecirc;me si notre objectif initial n&#39;est pas d&#39;acc&eacute;der au&nbsp;podium (la typologie de notre projet colle plus &agrave; celle d&#39;une association &agrave; but lucratif qu&#39;&agrave; celle d&#39;une startup), on se dit qu&#39;il y a toujours une chance. Cinq&nbsp;&eacute;quipes sont &eacute;limin&eacute;es, plus qu&#39;une et on monte sur le podium.<br />
	Soudain, l&#39;organisation fait une annonce : "il y a un nouveau prix, le "coup de coeur du jury", j&#39;ai nomm&eacute; l&#39;&eacute;quipe [roulements de tambour]... IDEAL".&nbsp;</span><span style="line-height: 1.6em;">Les membres du jury ont &eacute;t&eacute; s&eacute;duits par notre pitch mais aussi par&nbsp;</span><span style="line-height: 1.6em;">la complexit&eacute; et l&#39;int&eacute;ret (d&#39;un point de vue recherche) de l&#39;algorithme.</span></p>
<p>
	<a href="/blog-imagesigncenter size-medium wp-image-350" height="221" src="/blog-images/2014/02/2014-02-23-20/blog-images/blog-images
<h3>
	Les vainqueurs<br />
</h3>
<ul>
<li>
		Prix de l&#39;innovation : Ma Smart Box (une baterie pour stocker l&#39;&eacute;nergie en heures creuses et la consommer en heures pleines, &agrave; installer dans votre maison) :&nbsp;<a href="https://twitter.com/MaSmartBox" target="_blank">https://twitter.com/MaSmartBox</a>
	</li>
<li>
		Prix Business : Stop Tears (un shazam-like pour analyser et comprendre les pleurs des b&eacute;b&eacute;s) :&nbsp;<a href="https://twitter.com/StopTearsApp">https://twitter.com/StopTearsApp</a>
	</li>
<li>
		Prix UX Design : Nano Vare (un device personnel pemettant d&#39;analyser des &eacute;chantillons de sang rapidement pour d&eacute;tecter ou suivre certaines maladies) :&nbsp;<a href="https://twitter.com/NanoVare">https://twitter.com/NanoVare</a>
	</li>
</ul>
<h3>
	Conclusion<br />
</h3>
<p>
	Bien qu&#39;IDEAL, en l&#39;&eacute;tat, ne soit pas viable en termes&nbsp;de "startup", nous avons atteint nos&nbsp;objectifs en montant&nbsp;un projet et en permettant&nbsp;&agrave; Olivier (notre chercheur) de trouver des applications concr&egrave;tes&nbsp;&agrave; son algorithme &agrave; court terme. En plus, nous avons &eacute;t&eacute; r&eacute;compens&eacute;s, que demander de mieux ? :p</p>
<p>
	Je remercie et f&eacute;licite tout le monde&nbsp;:</p>
<ul>
<li>
		mon &eacute;quipe : qui a perform&eacute;, tout le monde a activement particip&eacute; de mani&egrave;re constructive
	</li>
<li>
		les organisateurs : qui ont g&eacute;r&eacute; tout le weekend
	</li>
<li>
		les coachs : qui ont su nous apporter de bons conseils
	</li>
<li>
		le jury : qui a particip&eacute; &agrave; la pr&eacute;sentation final
	</li>
<li>
		tous les participants : pour leur bonne humeur et leur ambition
	</li>
<li>
		Olivier : le monde&nbsp;a besoin de chercheurs comme toi ;)
	</li>
</ul>
<p>
	Une super exp&eacute;rience que je renouvellerai avec plaisir et que je vous encourage &agrave; faire (m&ecirc;me si vous n&#39;avez pas l&#39;intention de monter une startup).</p>
<p>
	Vous trouver les photos de l&#39;&eacute;v&egrave;nement <a href="http://startupweekend.us3.list-manage1.com/track/click?u=61a8ad4b979afe8aa00d56d56&amp;id=033b5f9951&amp;e=6c3be439c8" target="_blank">ici</a>.</p>
<p>
	<a href="/blog-imagesedium wp-image-364" height="90" src="/blog-images/2014/02/pictures-300x/blog-images/blog-images
