---
layout: blog
status: publish
published: true
title: BlendWebMix 2015 (deuxi&egrave;me jour)
author:
  display_name: Séverin Bruhat
  login: admin_sbr
  email: sbruhat@gmail.com
  url: https://severin-bruhat.com
author_login: admin_sbr
author_email: sbruhat@gmail.com
author_url: https://severin-bruhat.com
wordpress_id: 917
wordpress_url: http://severin-bruhat.com/?p=917
date: '2015-11-06 10:09:04 +0000'
date_gmt: '2015-11-06 09:09:04 +0000'
categories:
- Blog
tags:
- BlendWebMix
- dev
- business
- recherche
- design
comments: []
---
<a class="link-back" href="/blog/"><< Back to the list</a>
<h1>BlendWebMix 2015 (deuxi&egrave;me jour)</h1>

<p>
	Il y a quelques jours, j&#39;ai publi&eacute; un article concernant la <a href="http://severin-bruhat.com/blog/blendwebmix-2015-premier-jour/" target="_blank">premi&egrave;re journ&eacute;e de BlendWebMix</a>, maintenant voici un aper&ccedil;u des conf&eacute;rences qui m&#39;ont particuli&egrave;rement int&eacute;ress&eacute;es le deuxi&egrave;me jour.</p>
<p><!--more--></p>
<h2>
	L&rsquo;exp&eacute;rience utilisateur passe par la cr&eacute;ation d&rsquo;&eacute;motions<br />
</h2>
<p>
	<u>Speaker : </u>Jean-Fr&eacute;d&eacute;ric Passot <a href="https://twitter.com/03prod" target="_blank">@03prod</a></p>
<p>
	A travers sa riche exp&eacute;rience, Jean-Fr&eacute;d&eacute;ric Passot nous a rappel&eacute; les principaux buts d&#39;un bon design (j&#39;ai rat&eacute; les 5 premi&egrave;res minutes donc il en manque peut-&ecirc;tre) :</p>
<ul>
<li>
		Capter
	</li>
<li>
		Rassurer (donner des rep&egrave;res)
	</li>
<li>
		Immerger (&eacute;viter le superflu, donner une raison &agrave; l&#39;utilisateur de revenir, connecter l&#39;utilisateur avec le message)
	</li>
</ul>
<p>
	Jean-Fr&eacute;d&eacute;ric a illustr&eacute; ceci par des exemples, voici quelques expressions qui ont retenues mon attention :</p>
<ul>
<li>
		"il faut que chaque &eacute;l&eacute;ment d&rsquo;interface soit une preuve de ce que l&rsquo;on va raconter"
	</li>
<li>
		"la technique au service du sens"
	</li>
<li>
		"privil&eacute;gier les utilisations simples et instantan&eacute;es"
	</li>
<li>
		"&eacute;viter d&rsquo;interrompre, de tromper, de d&eacute;corer, de sur jouer"
	</li>
</ul>
<p>
	Jean-Fr&eacute;d&eacute;ric a &eacute;galement rappel&eacute; que "l&#39;&eacute;motion se vit mais se partage surtout", il faut donc encourager le visiteur &agrave; partager son aventure et pourquoi pas, poursuivre l&#39;exp&eacute;rience via un nouveau projet !</p>
<h2>
	Quelles tendances et quelles comp&eacute;tences pour la convergence des objets connect&eacute;s et de la robotique de service ?<br />
</h2>
<p>
	<u>Speaker : </u>J&eacute;r&ocirc;me Laplace <a href="https://twitter.com/GenerationRobot" target="_blank">@GenerationRobot</a></p>
<p>
	Le fondateur de <a href="http://www.generationrobots.com/fr/" target="_blank">generation robot</a> a tout d&#39;abord dress&eacute; un &eacute;tat de l&#39;art :</p>
<ul>
<li>
		Le march&eacute; des objets connect&eacute;s est en croissance de 20% sur 2015
	</li>
<li>
		Les plus gros acteurs sont : Intel, Cicso, IBM, Microsoft, Google, Apple Samsung...
	</li>
<li>
		Les acteurs de taille plus modeste : sont Sen.se, Withings, Parrot, Nest, Fitbit...
	</li>
</ul>
<blockquote class="twitter-tweet" lang="fr">
<p dir="ltr" lang="fr">
		Qui sont les acteurs du march&eacute; des <a href="https://twitter.com/hashtag/objetsconnect%C3%A9s?src=hash">#objetsconnect&eacute;s</a> ? Par <a href="https://twitter.com/GenerationRobot">@GenerationRobot</a> au <a href="https://twitter.com/hashtag/BlendWebMix?src=hash">#BlendWebMix</a> <a href="https://twitter.com/hashtag/IoT?src=hash">#IoT</a> <a href="https://t.co/k6v9PnAS1j">pic.twitter.com/k6v9PnAS1j</a>
	</p>
<p>
		&mdash; EMLYON B-School (@EMLYON) <a href="https://twitter.com/EMLYON/status/659665174610186240">29 Octobre 2015</a>
	</p>
</blockquote>
<p>
	<script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script></p>
<p>
	Objets connect&eacute;s, wearables, robots de service, robots domestiques... on est encore loin du robot compagnon dont certains r&ecirc;vent. Aujourd&#39;hui les principales avanc&eacute;es technologiques se font notamment au niveau des capteurs et des algorithmes .</p>
<h2>
	Comment communiquer sans budget ? L&#39;exemple Marc Dorcel.<br />
</h2>
<p>
	<u>Speaker :</u> Ghislain Faribeault&nbsp; <a href="https://twitter.com/faribeault" target="_blank">@faribeault</a></p>
<p>
	Contrairement &agrave; ce qu&#39;on pourrait penser, cette conf&eacute;rence fut int&eacute;ressante, impressionnante m&ecirc;me. Le vice pr&eacute;sident m&eacute;dia de la marque "Marc Dorcel" a pr&eacute;sent&eacute; ses techniques pour faire de la pub et du buzz avec z&eacute;ro euro d&#39;investissement en publicit&eacute;. Oui z&eacute;ro ! attention, dans certains cas la soci&eacute;t&eacute; fait appel &agrave; des agences de communication mais c&#39;est plut&ocirc;t rare.</p>
<p>
	Ghislain Faribeault a expliqu&eacute; et illustr&eacute; les axes de communication suivants :</p>
<ul>
<li>
		service client impeccable
	</li>
<li>
		contenu de qualit&eacute;
	</li>
<li>
		r&eacute;seaux sociaux
	</li>
<li>
		news jacking
	</li>
<li>
		goodies
	</li>
<li>
		<span class="ht">sponsorisation</span> d&#39;&eacute;v&egrave;nements (BDE)
	</li>
<li>
		calendrier
	</li>
<li>
		...
	</li>
</ul>
<p>
	Dorcel innove &eacute;galement&nbsp; &eacute;norm&eacute;ment, ce qui lui assure une publicit&eacute; sans frais car tout le monde s&#39;y int&eacute;resse : exemple simple et r&eacute;cent avec l&#39;Oculus Rift, m&ecirc;me <a href="http://www.lesnumeriques.com/mobilite/on-a-teste-porno-en-realite-virtuelle-dorcel-n46435.html" target="_blank">"Les num&eacute;riques"</a> a test&eacute; et r&eacute;dig&eacute; un article.</p>
<p>
	Un retour d&#39;exp&eacute;rience qui montre qu&#39;avec peu de moyens financiers, en saisissant les opportunit&eacute;s et avec un minimum d&#39;aisance sur les r&eacute;seaux sociaux, on peut faire de la pub !</p>
<h2>
	Pourquoi Drupal 8 est-il "une tuerie"&nbsp;?<br />
</h2>
<p>
	<u> Speaker&nbsp;:</u> L&eacute;on Cros&nbsp;<a href="https://twitter.com/chipway" target="_blank">@chipway</a></p>
<p>
	Cette conf&eacute;rence s&rsquo;adressait plut&ocirc;t aux n&eacute;ophytes et aux profils non techniques. Il s&rsquo;agissait principalement d&rsquo;un rappel des fonctionnalit&eacute;s Drupal 7 et des ajouts de la version 8.</p>
<p>
	Drupal est un moteur de gestion de contenu structur&eacute;e. La version 8 s&rsquo;appuie sur le Framework Symfony2. Drupal peut &ecirc;tre utilis&eacute; pour tout type de projet&nbsp;:</p>
<ul>
<li>
		Sites institutionnels
	</li>
<li>
		Collectivit&eacute;s et gouvernement
	</li>
<li>
		M&eacute;dia (Le Figaro)
	</li>
<li>
		Application m&eacute;tier
	</li>
<li>
		Boutique (Carrefour, Guerlin)
	</li>
<li>
		Extranet
	</li>
<li>
		Mus&eacute;e (Le Louvre)
	</li>
</ul>
<p>
	Pour information, 2% des sites web qui utilisent un CMS sont bas&eacute;s sur Drupal.</p>
<p>
	Voici les principales nouveaut&eacute;s de Drupal 8:</p>
<ul>
<li>
		Possibilit&eacute; de r&eacute;vision sur les blocs
	</li>
<li>
		Moteur de template Twig (remplace PHP Template)
	</li>
<li>
		Mobile :&nbsp;base responsive,&nbsp;webservices REST (headless)
	</li>
<li>
		Multilingue
	</li>
<li>
		Views et Migrate sont int&eacute;gr&eacute;s dans le c&oelig;ur
	</li>
<li>
		La configuration est g&eacute;r&eacute;e via des fichiers yml (puis stock&eacute;e en base pour le versionning)
	</li>
</ul>
<p>
	Drupal 8 sera disponible en version stable le 19 novembre :&nbsp;<a href="https://www.drupal.org/node/2605142" target="_blank">https://www.drupal.org/node/2605142</a>.</p>
<h2>
	L&#39;holacratie : le Syst&egrave;me d&#39;Exploitation des organisations agiles<br />
</h2>
<p>
	<u>Speaker&nbsp;:</u> Philippe Pinault&nbsp;&nbsp; <a href="https://twitter.com/ppinault" target="_blank">@ppinault </a></p>
<p>
	<u>Support : </u><a href="https://www.slideshare.net/slideshow/embed_code/key/3sifjsZIeFPAqn" target="_blank">https://www.slideshare.net/slideshow/embed_code/key/3sifjsZIeFPAqn</a></p>
<p>
	L&rsquo;holacratie est un ensemble d&rsquo;outils et de bonnes pratiques visant &agrave; mener &agrave; la performance. Ce syst&egrave;me apporte une r&eacute;ponse aux limites du mod&egrave;le hi&eacute;rarchique classique. Nous avons eu une excellente illustration d&egrave;s le d&eacute;but de la conf&eacute;rence. Philippe nous a demand&eacute; ce qui caract&eacute;rise une &eacute;quipe performante. Apr&egrave;s que l&rsquo;audience ait donn&eacute; diff&eacute;rentes d&eacute;finitions, Philippe a alors demand&eacute; pour qui c&#39;&eacute;tait le cas dans son entreprise, personne n&rsquo;a lev&eacute; le doigt&hellip;</p>
<p>
	Parmi les probl&egrave;mes rencontr&eacute;s dans une organisation classique, les principaux sont les suivants&nbsp;:</p>
<ul>
<li>
		Mauvais partage de l&rsquo;information
	</li>
<li>
		Status quo
	</li>
<li>
		&laquo;&nbsp;Petits chefs&nbsp;&raquo;
	</li>
<li>
		Outils d&eacute;pass&eacute;s
	</li>
<li>
		R&eacute;unions fr&eacute;quentes et inefficaces
	</li>
</ul>
<p>
	L&rsquo;holacratie part du constat selon lequel deux &eacute;carts sont &agrave; la source de nombreuses tensions&nbsp;:</p>
<ul>
<li>
		Un &eacute;cart entre &laquo;&nbsp;ce qui est&nbsp;&raquo; et &laquo;&nbsp;ce qui est r&eacute;ellement&nbsp;&raquo; &nbsp;(la fiche de poste n&rsquo;est pas partag&eacute;e entre les collaborateurs par exemple)
	</li>
<li>
		Un &eacute;cart entre &laquo;&nbsp;ce qui est r&eacute;ellement&nbsp;&raquo; et &laquo;&nbsp;ce qui pourrait &ecirc;tre mieux&nbsp;&raquo;(beaucoup de choses...)
	</li>
</ul>
<p>
	L&rsquo;holacratie consid&egrave;re chaque humain comme un capteur de tension et fait de chaque tension une opportunit&eacute; d&rsquo;am&eacute;lioration, c&rsquo;est la logique de pilotage dynamique. Elle d&eacute;finit un ensemble de r&egrave;gles du jeu pour organiser le travail (et non pas les personnes), ces r&egrave;gles sont disponibles sur <a href="https://github.com/holacracyone/Holacracy-Constitution" target="_blank">github</a>. L&#39;holacratie est bas&eacute;e sur la notion de r&ocirc;le, elle a pour fonction de permet de r&eacute;aliser un travail &agrave; faire. Le r&ocirc;le est d&eacute;finit par:</p>
<ul>
<li>
		Une&nbsp;raison d&rsquo;&ecirc;tre : ce que le r&ocirc;le peut faire, la finalit&eacute;
	</li>
<li>
		Un ou plusieurs domaines : ce que les autres ne peuvent pas faire
	</li>
<li>
		Une ou plusieurs&nbsp;recevabilit&eacute; : ce que le r&ocirc;le doit faire
	</li>
</ul>
<p>
	En conclusion, l&#39;holacratie est un levier pour :</p>
<ul>
<li>
		Rendre ce qui est implicite explicite (plus de clart&eacute;)
	</li>
<li>
		Changer aussi vite que le changement
	</li>
<li>
		Offrir un cadre pour d&eacute;livrer son potentiel maximum
	</li>
<li>
		Aligner&nbsp;l&rsquo;organisation&nbsp;sur sa raison d&rsquo;&ecirc;tre
	</li>
</ul>
<p>
	Je pourrai dire beaucoup de choses sur ce sujet qui m&rsquo;int&eacute;resse, mais je vais m&rsquo;arr&ecirc;ter l&agrave; car ce n&#39;est pas l&#39;objet de cet article. Cette conf&eacute;rence f&ucirc;t une excellente introduction, je vous invite &agrave; allez plus loin, en cherchant un peu sur le web il y a beaucoup d&#39;articles traitant de ce sujet, je vous invite &eacute;galement &agrave; regarder cette conf&eacute;rence de Fr&eacute;d&eacute;ric Laloux :</p>
<p>
	<iframe allowfullscreen="" frameborder="0" height="315" src="https://www.youtube.com/embed/NZKqPoQiaDE" width="560"></iframe></p>
<h2>
	Replay sur la refonte front-end de 6play.fr<br />
</h2>
<p>
	<u>Speaker :</u> Kenny Dits <a href="https://twitter.com/@kenny_dee" target="_blank">@kenny_dee</a></p>
<p>
	<u>Support : </u><a href="http://kennydee.github.io/conf-6playv4/#/" target="_blank">http://kennydee.github.io/conf-6playv4/#/</a></p>
<p>
	Cette conf&eacute;rence &eacute;tait une pr&eacute;sentation de la mise en place du nouveau site <a href="http://beta.6play.fr/" target="_blank">m6play.</a> Kenny a &eacute;nonc&eacute; les objectifs de la nouvelle plateforme sur lesquels l&#39;&eacute;quipe de M6Web s&#39;est bas&eacute;e pour choisir les technologies :</p>
<ul>
<li>
		la plateforme doit ressembler &agrave; une application
	</li>
<li>
		la plateforme doit &ecirc;tre performante
	</li>
<li>
		la plateforme doit &ecirc;tre SEO-friendly
	</li>
</ul>
<p>
	C&#39;est ainsi que M6Web a d&eacute;cid&eacute; de partir sur une architecture Single Page App bas&eacute;e sur :</p>
<ul>
<li>
		<a href="https://facebook.github.io/react/" target="_blank">React js</a>
	</li>
<li>
		<a href="http://fluxible.io/" target="_blank">Fluxible.io</a>
	</li>
</ul>
<p>
	Kenny a expliqu&eacute; les diff&eacute;rentes m&eacute;thodologies de travail mises en place, les technologies utilis&eacute;es, les points positifs et n&eacute;gatifs du projet etc. Bref, un tr&egrave;s bon retour d&#39;exp&eacute;rience qui montre que chez M6Web, on n&#39;a pas peur de jouer avec les nouvelles technologies !</p>
<h2>
	Conclusion<br />
</h2>
<p>
	Vivement le BlendWebMix 2016 !!!</p>
