---
layout: post
status: publish
published: true
title: Technique du Pomodoro - retour d'XP
author:
  display_name: Séverin Bruhat
  login: admin_sbr
  email: sbruhat@gmail.com
  url: http://severin-bruhat.com
author_login: admin_sbr
author_email: sbruhat@gmail.com
author_url: http://severin-bruhat.com
wordpress_id: 1226
wordpress_url: http://severin-bruhat.local/?p=1226
date: '2016-08-29 07:49:09 +0100'
date_gmt: '2016-08-29 06:49:09 +0100'
categories:
- Blog
tags:
- productivit&eacute;
- pomodoro
comments:
- id: 345
  author: Idem
  author_email: Idem@yahoo.fr
  author_url: ''
  date: '2016-12-05 13:01:11 +0000'
  date_gmt: '2016-12-05 12:01:11 +0000'
  content: "\r\n\tCet article m&#039;a convaincu. OK, c&#039;est parti, je teste.\r\n\r\n\r\n\r\n\t&nbsp;\r\n\r\n\r\n\r\n\tJe
    reviens dans 25 minutes pour faire part de mes impressions...\r\n"
- id: 346
  author: S&eacute;verin Bruhat
  author_email: sbruhat@gmail.com
  author_url: http://severin-bruhat.com
  date: '2016-12-07 21:58:23 +0000'
  date_gmt: '2016-12-07 20:58:23 +0000'
  content: "<p>\r\n\tAlors ? Ces impressions ?\r\n</p>"
---
<p>
	Il y a quelques temps j&#39;ai publi&eacute; un article concernant la <a href="http://severin-bruhat.local/blog/la-technique-du-pomodoro/">technique du Pomodoro</a>. Fin 2015 j&#39;ai d&eacute;cid&eacute; de me lancer dans un nouveau projet professionnel pour d&eacute;velopper un r&eacute;seau d&eacute;di&eacute; aux professionnels du num&eacute;rique (<a href="https://numerikhub.com/">numerik&#39;Hub</a>), j&#39;ai donc tout plaqu&eacute; pour me concentrer &agrave; 100% sur ce projet et travailler en Home Office. J&#39;en ai profit&eacute;&nbsp;pour tester la m&eacute;thode du Pomodoro ;&nbsp;je souhaite aujourd&#39;hui vous partager mon retour d&#39;exp&eacute;rience.</p>
<p>
	<!--more--></p>
<h2>
	Ma m&eacute;thode<br />
</h2>
<ul>
<li>
		Je g&egrave;re les t&acirc;ches &agrave; effectuer avec&nbsp;<a href="https://trello.com/" target="_blank">Trello</a>
	</li>
<li>
		J&#39;utilise <a href="https://itunes.apple.com/fr/app/pomodoro-one/id907364780?mt=12" target="_blank">Pomodoro One</a>&nbsp;comme minuteur
	</li>
<li>
		Pour le reste j&#39;applique simplement la m&eacute;thode 25 minutes de travail / 5 minutes de pause (avec une pause de 15 minutes tous les quatre <em>pomodori</em>)
	</li>
</ul>
<p style="text-align: center;">
	<img alt="Pomodoro One" class="aligncenter size-full wp-image-1230" height="382" src="http://severin-bruhat.local/wp-content/uploads/2016/08/Capture-d&rsquo;écran-2016-08-27-à-12.58.33.png" style="" title="" width="262" /></p>
<h2>
	&nbsp;<br />
</h2>
<h2>
	Mon point de vue<br />
</h2>
<p>
	Je trouve la technique du Pomodoro&nbsp;tr&egrave;s utile. En effet je l&#39;utilise r&eacute;guli&egrave;rement (pas syst&eacute;matiquement, je reviendrais l&agrave;-dessus un peu plus loin) et c&#39;est fou comme &ccedil;a fonctionne.</p>
<p>
	En 25 minutes de concentration intense j&#39;ai suffisamment de temps pour bien avancer sur mes t&acirc;ches sans me lasser. 25 minutes c&#39;est court, il faut donc bien d&eacute;couper ses t&acirc;ches pour les r&eacute;aliser de pr&eacute;f&eacute;rence en 25 minutes maximum. Les pauses de 5 minutes, quant&nbsp;&agrave; elles, sont les bienvenues et permettent de bouger un peu (sortir de devant son &eacute;cran et se lever), de ranger un peu (et oui quand on bosse de chez soi, il faut &eacute;viter le d&eacute;sordre, c&#39;est d&eacute;motivant), de se faire un caf&eacute; etc.</p>
<p>
	J&#39;utilise cette m&eacute;thode tr&egrave;s r&eacute;guli&egrave;rement, notamment lorsque j&#39;ai du mal &agrave; rester concentrer (emails, Twitter &amp; co)&nbsp;ou lorsque j&#39;ai des t&acirc;ches peu motivantes &agrave; r&eacute;aliser. En revanche dans certains cas, je suis tr&egrave;s motiv&eacute;, j&#39;avance bien et je travaille en mode classique sans regarder le chrono. Je dirai que j&#39;utilise cette technique les deux tiers du temps et honn&ecirc;tement je n&#39;en retiens que des b&eacute;n&eacute;fices :</p>
<ul>
<li>
		Meilleure&nbsp;estimation des t&acirc;ches &agrave; r&eacute;aliser
	</li>
<li>
		Gain de productivit&eacute;
	</li>
<li>
		Augmentation des facult&eacute;s de concentration
	</li>
<li>
		Eloignement de l&#39;&eacute;cran et quelques pas toutes les 25 minutes
	</li>
</ul>
<p>
	&nbsp;</p>
<h2>
	Am&eacute;liorations de ma pratique<br />
</h2>
<p>
	Tout d&#39;abord, il m&#39;arrive quelques fois, dans ces 25 minutes d&#39;aller regarder mes emails ou de r&eacute;pondre &agrave; un SMS, il faudrait que je puisse me passer de ces distractions.</p>
<p>
	Ensuite, dans certains cas, par flemme, je ne d&eacute;coupe pas mes t&acirc;ches en sous-t&acirc;ches et travaille&nbsp;donc plusieurs fois 25 minutes sur la m&ecirc;me, dans l&#39;id&eacute;al il faudrait les d&eacute;couper davantage.</p>
<p>
	Enfin, il serait int&eacute;ressant de noter et d&#39;analyser les moments de distraction&nbsp;afin d&#39;en prendre conscience et de les r&eacute;duire. Par exemple, lorsque j&#39;ai envie d&#39;aller sur Twitter, je devrais le noter sur un Post&#39;it et en fin de journ&eacute;e faire le bilan.</p>
<h2>
	Conclusion<br />
</h2>
<p>
	Pour conclure cet article, apr&egrave;s plusieurs mois de pratique, je suis convaincu de l&#39;efficacit&eacute; de la technique du Pomodoro. Bien qu&#39;il puisse &ecirc;tre difficile de travailler pas tranche de 25 minutes dans certains cas (poste ou&nbsp; milieu professionnel par exemple), je vous encourage &agrave; tester, ne serait-ce qu&#39;une fois par jour : 25 minutes sans mail, sans t&eacute;l&eacute;phone, sans r&eacute;union, sans distraction, juste 25 minutes d&#39;efficacit&eacute; !</p>
